//concat: 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
let a =[1,2,3], b = [4, 5, 6];
let c = a.concat([4,5,6]);
console.log(c);

//reverse: 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
let d = [1, 2, 3];
d.reverse(1, 2, 3);
console.log(d);

//push, unshift: 3. Дан массив [1, 2, 3]. Добавьте ему В КОНЕЦ элементы 4, 5, 6.
let f = [1, 2, 3];
f.push(4, 5, 6);
console.log(f);

//4. Дан массив [1, 2, 3]. Добавьте ему В НАЧАЛО элементы 4, 5, 6.
let g = [1, 2, 3];
g.unshift(4, 5, 6);
console.log(g);

//shift, pop:5. Дан массив [7, 9, 3]. Выведите на экран первый элемент.
let h = [7, 9, 3];
console.log(h.shift());

//6. Дан массив [7, 9, 3]. Выведите на экран последний элемент.
let j = [7, 9, 3];
console.log(j.pop());

//slice:7. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
let k = [1, 2, 3, 4, 5];
let m = k.slice(0, 3);
console.log(m);

//8. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].
let p = [1, 2, 3, 4, 5];
let q = p.slice(3, 5);
console.log(q);